In [3]:
import numpy as np
import pandas as pd

In [6]:
df = pd.read_csv("Demo.csv")

df

  Name  Age  Marks  Gender
0    A   21     56    Male
1    B   23     78  Female
2    C   43     54  Female
3    D   25     90    Male
4    E   45     82    Male

In [8]:
# Males older than 50
df[(df["Gender"] == "Male") & (df["Age"] < 40)]

  Name  Age  Marks Gender
0    A   21     56   Male
3    D   25     90   Male

In [7]:
df2 = pd.read_csv("./nba.csv")

In [8]:
df2

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [9]:
df2.shape

(458, 9)

In [10]:
df2.size

4122

In [12]:
aryanbhai = pd.concat([df,df2],ignore_index=True)

In [13]:
aryanbhai.tail()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
911,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
912,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
913,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
914,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
915,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [14]:
df2.Name

0      Avery Bradley
1        Jae Crowder
2       John Holland
3        R.J. Hunter
4      Jonas Jerebko
           ...
453     Shelvin Mack
454        Raul Neto
455     Tibor Pleiss
456      Jeff Withey
457              NaN
Name: Name, Length: 458, dtype: object

In [22]:
df2.Team.unique()

array(['Boston Celtics', 'Brooklyn Nets', 'New York Knicks',
       'Philadelphia 76ers', 'Toronto Raptors', 'Golden State Warriors',
       'Los Angeles Clippers', 'Los Angeles Lakers', 'Phoenix Suns',
       'Sacramento Kings', 'Chicago Bulls', 'Cleveland Cavaliers',
       'Detroit Pistons', 'Indiana Pacers', 'Milwaukee Bucks',
       'Dallas Mavericks', 'Houston Rockets', 'Memphis Grizzlies',
       'New Orleans Pelicans', 'San Antonio Spurs', 'Atlanta Hawks',
       'Charlotte Hornets', 'Miami Heat', 'Orlando Magic',
       'Washington Wizards', 'Denver Nuggets', 'Minnesota Timberwolves',
       'Oklahoma City Thunder', 'Portland Trail Blazers', 'Utah Jazz',
       nan], dtype=object)

In [20]:
df.Team.size

458

In [21]:
df.Team.nunique()

30

In [24]:
df.sample()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
78,Andrew Bogut,Golden State Warriors,12.0,C,31.0,7-0,260.0,Utah,13800000.0

In [28]:
df.isnull().sum(axis=1)

0      0
1      0
2      1
3      0
4      1
      ..
453    0
454    1
455    1
456    0
457    9
Length: 458, dtype: int64

In [29]:
df.describe()

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

In [30]:
df.Age[0]

np.float64(25.0)

In [ ]:
df.Number[0]

In [4]:
df = pd.read_csv("demoPD.csv")
df

  Name|Age|Gender
0   vinay|21|Male
1     Raj|30|Male
2  rani|17|Female
3      Rj|24|Male